---
type: UnitTypeId
namespace: Autodesk.Revit.DB
version: 2024
members: 298
tags: [revit-api, class]
---

# UnitTypeId

`Autodesk.Revit.DB.UnitTypeId` · Revit 2024 · 298 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | Acres | 2021 | `public static ForgeTypeId Acres { get ; }` |
| Property | Amperes | 2021 | `public static ForgeTypeId Amperes { get ; }` |
| Property | Atmospheres | 2021 | `public static ForgeTypeId Atmospheres { get ; }` |
| Property | Bars | 2021 | `public static ForgeTypeId Bars { get ; }` |
| Property | BritishThermalUnits | 2021 | `public static ForgeTypeId BritishThermalUnits { get ; }` |
| Property | BritishThermalUnitsPerDegreeFahrenheit | 2021 | `public static ForgeTypeId BritishThermalUnitsPerDegreeFahrenheit { get ; }` |
| Property | BritishThermalUnitsPerHour | 2021 | `public static ForgeTypeId BritishThermalUnitsPerHour { get ; }` |
| Property | BritishThermalUnitsPerHourCubicFoot | 2021 | `public static ForgeTypeId BritishThermalUnitsPerHourCubicFoot { get ; }` |
| Property | BritishThermalUnitsPerHourFootDegreeFahrenheit | 2021 | `public static ForgeTypeId BritishThermalUnitsPerHourFootDegreeFahrenheit { get ; }` |
| Property | BritishThermalUnitsPerHourSquareFoot | 2021 | `public static ForgeTypeId BritishThermalUnitsPerHourSquareFoot { get ; }` |
| Property | BritishThermalUnitsPerHourSquareFootDegreeFahrenheit | 2021 | `public static ForgeTypeId BritishThermalUnitsPerHourSquareFootDegreeFahrenheit { get ; }` |
| Property | BritishThermalUnitsPerPound | 2021 | `public static ForgeTypeId BritishThermalUnitsPerPound { get ; }` |
| Property | BritishThermalUnitsPerPoundDegreeFahrenheit | 2021 | `public static ForgeTypeId BritishThermalUnitsPerPoundDegreeFahrenheit { get ; }` |
| Property | BritishThermalUnitsPerSecond | 2021 | `public static ForgeTypeId BritishThermalUnitsPerSecond { get ; }` |
| Property | BritishThermalUnitsPerSquareFootDegreeFahrenheit | 2021 | `public static ForgeTypeId BritishThermalUnitsPerSquareFootDegreeFahrenheit { get ; }` |
| Property | Calories | 2021 | `public static ForgeTypeId Calories { get ; }` |
| Property | CaloriesPerSecond | 2021 | `public static ForgeTypeId CaloriesPerSecond { get ; }` |
| Property | Candelas | 2021 | `public static ForgeTypeId Candelas { get ; }` |
| Property | CandelasPerSquareFoot | 2021 | `public static ForgeTypeId CandelasPerSquareFoot { get ; }` |
| Property | CandelasPerSquareMeter | 2021 | `public static ForgeTypeId CandelasPerSquareMeter { get ; }` |
| Property | Celsius | 2021 | `public static ForgeTypeId Celsius { get ; }` |
| Property | CelsiusInterval | 2021 | `public static ForgeTypeId CelsiusInterval { get ; }` |
| Property | Centimeters | 2021 | `public static ForgeTypeId Centimeters { get ; }` |
| Property | CentimetersPerMinute | 2021 | `public static ForgeTypeId CentimetersPerMinute { get ; }` |
| Property | CentimetersToTheFourthPower | 2021 | `public static ForgeTypeId CentimetersToTheFourthPower { get ; }` |
| Property | CentimetersToTheSixthPower | 2021 | `public static ForgeTypeId CentimetersToTheSixthPower { get ; }` |
| Property | Centipoises | 2021 | `public static ForgeTypeId Centipoises { get ; }` |
| Property | CubicCentimeters | 2021 | `public static ForgeTypeId CubicCentimeters { get ; }` |
| Property | CubicFeet | 2021 | `public static ForgeTypeId CubicFeet { get ; }` |
| Property | CubicFeetPerHour | 2021 | `public static ForgeTypeId CubicFeetPerHour { get ; }` |
| Property | CubicFeetPerKip | 2021 | `public static ForgeTypeId CubicFeetPerKip { get ; }` |
| Property | CubicFeetPerMinute | 2021 | `public static ForgeTypeId CubicFeetPerMinute { get ; }` |
| Property | CubicFeetPerMinuteCubicFoot | 2021 | `public static ForgeTypeId CubicFeetPerMinuteCubicFoot { get ; }` |
| Property | CubicFeetPerMinutePerBritishThermalUnitPerHour | 2021 | `public static ForgeTypeId CubicFeetPerMinutePerBritishThermalUnitPerHour { get ; }` |
| Property | CubicFeetPerMinuteSquareFoot | 2021 | `public static ForgeTypeId CubicFeetPerMinuteSquareFoot { get ; }` |
| Property | CubicFeetPerMinuteTonOfRefrigeration | 2021 | `public static ForgeTypeId CubicFeetPerMinuteTonOfRefrigeration { get ; }` |
| Property | CubicFeetPerPoundMass | 2021 | `public static ForgeTypeId CubicFeetPerPoundMass { get ; }` |
| Property | CubicInches | 2021 | `public static ForgeTypeId CubicInches { get ; }` |
| Property | CubicMeters | 2021 | `public static ForgeTypeId CubicMeters { get ; }` |
| Property | CubicMetersPerHour | 2021 | `public static ForgeTypeId CubicMetersPerHour { get ; }` |
| Property | CubicMetersPerHourCubicMeter | 2021 | `public static ForgeTypeId CubicMetersPerHourCubicMeter { get ; }` |
| Property | CubicMetersPerHourSquareMeter | 2021 | `public static ForgeTypeId CubicMetersPerHourSquareMeter { get ; }` |
| Property | CubicMetersPerKilogram | 2021 | `public static ForgeTypeId CubicMetersPerKilogram { get ; }` |
| Property | CubicMetersPerKilonewton | 2021 | `public static ForgeTypeId CubicMetersPerKilonewton { get ; }` |
| Property | CubicMetersPerSecond | 2021 | `public static ForgeTypeId CubicMetersPerSecond { get ; }` |
| Property | CubicMetersPerWattSecond | 2021 | `public static ForgeTypeId CubicMetersPerWattSecond { get ; }` |
| Property | CubicMillimeters | 2021 | `public static ForgeTypeId CubicMillimeters { get ; }` |
| Property | CubicYards | 2021 | `public static ForgeTypeId CubicYards { get ; }` |
| Property | Currency | 2021 | `public static ForgeTypeId Currency { get ; }` |
| Property | CurrencyPerBritishThermalUnit | 2021 | `public static ForgeTypeId CurrencyPerBritishThermalUnit { get ; }` |
| Property | CurrencyPerBritishThermalUnitPerHour | 2021 | `public static ForgeTypeId CurrencyPerBritishThermalUnitPerHour { get ; }` |
| Property | CurrencyPerSquareFoot | 2021 | `public static ForgeTypeId CurrencyPerSquareFoot { get ; }` |
| Property | CurrencyPerSquareMeter | 2021 | `public static ForgeTypeId CurrencyPerSquareMeter { get ; }` |
| Property | CurrencyPerWatt | 2021 | `public static ForgeTypeId CurrencyPerWatt { get ; }` |
| Property | CurrencyPerWattHour | 2021 | `public static ForgeTypeId CurrencyPerWattHour { get ; }` |
| Property | Custom | 2021 | `public static ForgeTypeId Custom { get ; }` |
| Property | CyclesPerSecond | 2021 | `public static ForgeTypeId CyclesPerSecond { get ; }` |
| Property | Decimeters | 2021 | `public static ForgeTypeId Decimeters { get ; }` |
| Property | Degrees | 2021 | `public static ForgeTypeId Degrees { get ; }` |
| Property | DegreesMinutes | 2021 | `public static ForgeTypeId DegreesMinutes { get ; }` |
| Property | DekanewtonMeters | 2021 | `public static ForgeTypeId DekanewtonMeters { get ; }` |
| Property | DekanewtonMetersPerMeter | 2021 | `public static ForgeTypeId DekanewtonMetersPerMeter { get ; }` |
| Property | Dekanewtons | 2021 | `public static ForgeTypeId Dekanewtons { get ; }` |
| Property | DekanewtonsPerMeter | 2021 | `public static ForgeTypeId DekanewtonsPerMeter { get ; }` |
| Property | DekanewtonsPerSquareMeter | 2021 | `public static ForgeTypeId DekanewtonsPerSquareMeter { get ; }` |
| Property | Fahrenheit | 2021 | `public static ForgeTypeId Fahrenheit { get ; }` |
| Property | FahrenheitInterval | 2021 | `public static ForgeTypeId FahrenheitInterval { get ; }` |
| Property | Feet | 2021 | `public static ForgeTypeId Feet { get ; }` |
| Property | FeetFractionalInches | 2021 | `public static ForgeTypeId FeetFractionalInches { get ; }` |
| Property | FeetOfWater39_2DegreesFahrenheit | 2021 | `public static ForgeTypeId FeetOfWater39_2DegreesFahrenheit { get ; }` |
| Property | FeetOfWater39_2DegreesFahrenheitPer100Feet | 2021 | `public static ForgeTypeId FeetOfWater39_2DegreesFahrenheitPer100Feet { get ; }` |
| Property | FeetPerKip | 2021 | `public static ForgeTypeId FeetPerKip { get ; }` |
| Property | FeetPerMinute | 2021 | `public static ForgeTypeId FeetPerMinute { get ; }` |
| Property | FeetPerSecond | 2021 | `public static ForgeTypeId FeetPerSecond { get ; }` |
| Property | FeetPerSecondSquared | 2021 | `public static ForgeTypeId FeetPerSecondSquared { get ; }` |
| Property | FeetToTheFourthPower | 2021 | `public static ForgeTypeId FeetToTheFourthPower { get ; }` |
| Property | FeetToTheSixthPower | 2021 | `public static ForgeTypeId FeetToTheSixthPower { get ; }` |
| Property | Fixed | 2021 | `public static ForgeTypeId Fixed { get ; }` |
| Property | Footcandles | 2021 | `public static ForgeTypeId Footcandles { get ; }` |
| Property | Footlamberts | 2021 | `public static ForgeTypeId Footlamberts { get ; }` |
| Property | FractionalInches | 2021 | `public static ForgeTypeId FractionalInches { get ; }` |
| Property | General | 2021 | `public static ForgeTypeId General { get ; }` |
| Property | Gradians | 2021 | `public static ForgeTypeId Gradians { get ; }` |
| Property | GrainsPerHourSquareFootInchMercury | 2021 | `public static ForgeTypeId GrainsPerHourSquareFootInchMercury { get ; }` |
| Property | Hectares | 2021 | `public static ForgeTypeId Hectares { get ; }` |
| Property | Hertz | 2021 | `public static ForgeTypeId Hertz { get ; }` |
| Property | Horsepower | 2021 | `public static ForgeTypeId Horsepower { get ; }` |
| Property | HourSquareFootDegreesFahrenheitPerBritishThermalUnit | 2021 | `public static ForgeTypeId HourSquareFootDegreesFahrenheitPerBritishThermalUnit { get ; }` |
| Property | Hours | 2021 | `public static ForgeTypeId Hours { get ; }` |
| Property | Inches | 2021 | `public static ForgeTypeId Inches { get ; }` |
| Property | InchesOfMercury32DegreesFahrenheit | 2021 | `public static ForgeTypeId InchesOfMercury32DegreesFahrenheit { get ; }` |
| Property | InchesOfWater60DegreesFahrenheit | 2021 | `public static ForgeTypeId InchesOfWater60DegreesFahrenheit { get ; }` |
| Property | InchesOfWater60DegreesFahrenheitPer100Feet | 2021 | `public static ForgeTypeId InchesOfWater60DegreesFahrenheitPer100Feet { get ; }` |
| Property | InchesPerSecondSquared | 2021 | `public static ForgeTypeId InchesPerSecondSquared { get ; }` |
| Property | InchesToTheFourthPower | 2021 | `public static ForgeTypeId InchesToTheFourthPower { get ; }` |
| Property | InchesToTheSixthPower | 2021 | `public static ForgeTypeId InchesToTheSixthPower { get ; }` |
| Property | InverseDegreesCelsius | 2021 | `public static ForgeTypeId InverseDegreesCelsius { get ; }` |
| Property | InverseDegreesFahrenheit | 2021 | `public static ForgeTypeId InverseDegreesFahrenheit { get ; }` |
| Property | InverseKilonewtons | 2021 | `public static ForgeTypeId InverseKilonewtons { get ; }` |
| Property | InverseKips | 2021 | `public static ForgeTypeId InverseKips { get ; }` |
| Property | Joules | 2021 | `public static ForgeTypeId Joules { get ; }` |
| Property | JoulesPerGram | 2021 | `public static ForgeTypeId JoulesPerGram { get ; }` |
| Property | JoulesPerGramDegreeCelsius | 2021 | `public static ForgeTypeId JoulesPerGramDegreeCelsius { get ; }` |
| Property | JoulesPerKelvin | 2021 | `public static ForgeTypeId JoulesPerKelvin { get ; }` |
| Property | JoulesPerKilogramDegreeCelsius | 2021 | `public static ForgeTypeId JoulesPerKilogramDegreeCelsius { get ; }` |
| Property | JoulesPerSquareMeterKelvin | 2021 | `public static ForgeTypeId JoulesPerSquareMeterKelvin { get ; }` |
| Property | Kelvin | 2021 | `public static ForgeTypeId Kelvin { get ; }` |
| Property | KelvinInterval | 2021 | `public static ForgeTypeId KelvinInterval { get ; }` |
| Property | Kiloamperes | 2021 | `public static ForgeTypeId Kiloamperes { get ; }` |
| Property | Kilocalories | 2021 | `public static ForgeTypeId Kilocalories { get ; }` |
| Property | KilocaloriesPerSecond | 2021 | `public static ForgeTypeId KilocaloriesPerSecond { get ; }` |
| Property | KilogramForceMeters | 2021 | `public static ForgeTypeId KilogramForceMeters { get ; }` |
| Property | KilogramForceMetersPerMeter | 2021 | `public static ForgeTypeId KilogramForceMetersPerMeter { get ; }` |
| Property | Kilograms | 2021 | `public static ForgeTypeId Kilograms { get ; }` |
| Property | KilogramsForce | 2021 | `public static ForgeTypeId KilogramsForce { get ; }` |
| Property | KilogramsForcePerMeter | 2021 | `public static ForgeTypeId KilogramsForcePerMeter { get ; }` |
| Property | KilogramsForcePerSquareMeter | 2021 | `public static ForgeTypeId KilogramsForcePerSquareMeter { get ; }` |
| Property | KilogramsPerCubicMeter | 2021 | `public static ForgeTypeId KilogramsPerCubicMeter { get ; }` |
| Property | KilogramsPerHour | 2021 | `public static ForgeTypeId KilogramsPerHour { get ; }` |
| Property | KilogramsPerKilogramKelvin | 2021 | `public static ForgeTypeId KilogramsPerKilogramKelvin { get ; }` |
| Property | KilogramsPerMeter | 2021 | `public static ForgeTypeId KilogramsPerMeter { get ; }` |
| Property | KilogramsPerMeterHour | 2021 | `public static ForgeTypeId KilogramsPerMeterHour { get ; }` |
| Property | KilogramsPerMeterSecond | 2021 | `public static ForgeTypeId KilogramsPerMeterSecond { get ; }` |
| Property | KilogramsPerMinute | 2021 | `public static ForgeTypeId KilogramsPerMinute { get ; }` |
| Property | KilogramsPerSecond | 2021 | `public static ForgeTypeId KilogramsPerSecond { get ; }` |
| Property | KilogramsPerSquareMeter | 2021 | `public static ForgeTypeId KilogramsPerSquareMeter { get ; }` |
| Property | Kilojoules | 2021 | `public static ForgeTypeId Kilojoules { get ; }` |
| Property | KilojoulesPerKelvin | 2021 | `public static ForgeTypeId KilojoulesPerKelvin { get ; }` |
| Property | KilojoulesPerSquareMeterKelvin | 2021 | `public static ForgeTypeId KilojoulesPerSquareMeterKelvin { get ; }` |
| Property | KilometersPerHour | 2021 | `public static ForgeTypeId KilometersPerHour { get ; }` |
| Property | KilometersPerSecondSquared | 2021 | `public static ForgeTypeId KilometersPerSecondSquared { get ; }` |
| Property | KilonewtonMeters | 2021 | `public static ForgeTypeId KilonewtonMeters { get ; }` |
| Property | KilonewtonMetersPerDegree | 2021 | `public static ForgeTypeId KilonewtonMetersPerDegree { get ; }` |
| Property | KilonewtonMetersPerDegreePerMeter | 2021 | `public static ForgeTypeId KilonewtonMetersPerDegreePerMeter { get ; }` |
| Property | KilonewtonMetersPerMeter | 2021 | `public static ForgeTypeId KilonewtonMetersPerMeter { get ; }` |
| Property | Kilonewtons | 2021 | `public static ForgeTypeId Kilonewtons { get ; }` |
| Property | KilonewtonsPerCubicMeter | 2021 | `public static ForgeTypeId KilonewtonsPerCubicMeter { get ; }` |
| Property | KilonewtonsPerMeter | 2021 | `public static ForgeTypeId KilonewtonsPerMeter { get ; }` |
| Property | KilonewtonsPerSquareCentimeter | 2021 | `public static ForgeTypeId KilonewtonsPerSquareCentimeter { get ; }` |
| Property | KilonewtonsPerSquareMeter | 2021 | `public static ForgeTypeId KilonewtonsPerSquareMeter { get ; }` |
| Property | KilonewtonsPerSquareMillimeter | 2021 | `public static ForgeTypeId KilonewtonsPerSquareMillimeter { get ; }` |
| Property | Kilopascals | 2021 | `public static ForgeTypeId Kilopascals { get ; }` |
| Property | KilovoltAmperes | 2021 | `public static ForgeTypeId KilovoltAmperes { get ; }` |
| Property | Kilovolts | 2021 | `public static ForgeTypeId Kilovolts { get ; }` |
| Property | KilowattHours | 2021 | `public static ForgeTypeId KilowattHours { get ; }` |
| Property | Kilowatts | 2021 | `public static ForgeTypeId Kilowatts { get ; }` |
| Property | KipFeet | 2021 | `public static ForgeTypeId KipFeet { get ; }` |
| Property | KipFeetPerDegree | 2021 | `public static ForgeTypeId KipFeetPerDegree { get ; }` |
| Property | KipFeetPerDegreePerFoot | 2021 | `public static ForgeTypeId KipFeetPerDegreePerFoot { get ; }` |
| Property | KipFeetPerFoot | 2021 | `public static ForgeTypeId KipFeetPerFoot { get ; }` |
| Property | Kips | 2021 | `public static ForgeTypeId Kips { get ; }` |
| Property | KipsPerCubicFoot | 2021 | `public static ForgeTypeId KipsPerCubicFoot { get ; }` |
| Property | KipsPerCubicInch | 2021 | `public static ForgeTypeId KipsPerCubicInch { get ; }` |
| Property | KipsPerFoot | 2021 | `public static ForgeTypeId KipsPerFoot { get ; }` |
| Property | KipsPerInch | 2021 | `public static ForgeTypeId KipsPerInch { get ; }` |
| Property | KipsPerSquareFoot | 2021 | `public static ForgeTypeId KipsPerSquareFoot { get ; }` |
| Property | KipsPerSquareInch | 2021 | `public static ForgeTypeId KipsPerSquareInch { get ; }` |
| Property | Liters | 2021 | `public static ForgeTypeId Liters { get ; }` |
| Property | LitersPerHour | 2021 | `public static ForgeTypeId LitersPerHour { get ; }` |
| Property | LitersPerMinute | 2021 | `public static ForgeTypeId LitersPerMinute { get ; }` |
| Property | LitersPerSecond | 2021 | `public static ForgeTypeId LitersPerSecond { get ; }` |
| Property | LitersPerSecondCubicMeter | 2021 | `public static ForgeTypeId LitersPerSecondCubicMeter { get ; }` |
| Property | LitersPerSecondKilowatt | 2021 | `public static ForgeTypeId LitersPerSecondKilowatt { get ; }` |
| Property | LitersPerSecondSquareMeter | 2021 | `public static ForgeTypeId LitersPerSecondSquareMeter { get ; }` |
| Property | Lumens | 2021 | `public static ForgeTypeId Lumens { get ; }` |
| Property | LumensPerWatt | 2021 | `public static ForgeTypeId LumensPerWatt { get ; }` |
| Property | Lux | 2021 | `public static ForgeTypeId Lux { get ; }` |
| Property | MeganewtonMeters | 2021 | `public static ForgeTypeId MeganewtonMeters { get ; }` |
| Property | MeganewtonMetersPerMeter | 2021 | `public static ForgeTypeId MeganewtonMetersPerMeter { get ; }` |
| Property | Meganewtons | 2021 | `public static ForgeTypeId Meganewtons { get ; }` |
| Property | MeganewtonsPerMeter | 2021 | `public static ForgeTypeId MeganewtonsPerMeter { get ; }` |
| Property | MeganewtonsPerSquareMeter | 2021 | `public static ForgeTypeId MeganewtonsPerSquareMeter { get ; }` |
| Property | Megapascals | 2021 | `public static ForgeTypeId Megapascals { get ; }` |
| Property | Meters | 2021 | `public static ForgeTypeId Meters { get ; }` |
| Property | MetersCentimeters | 2021 | `public static ForgeTypeId MetersCentimeters { get ; }` |
| Property | MetersOfWaterColumn | 2021 | `public static ForgeTypeId MetersOfWaterColumn { get ; }` |
| Property | MetersOfWaterColumnPerMeter | 2021 | `public static ForgeTypeId MetersOfWaterColumnPerMeter { get ; }` |
| Property | MetersPerKilonewton | 2021 | `public static ForgeTypeId MetersPerKilonewton { get ; }` |
| Property | MetersPerSecond | 2021 | `public static ForgeTypeId MetersPerSecond { get ; }` |
| Property | MetersPerSecondSquared | 2021 | `public static ForgeTypeId MetersPerSecondSquared { get ; }` |
| Property | MetersToTheFourthPower | 2021 | `public static ForgeTypeId MetersToTheFourthPower { get ; }` |
| Property | MetersToTheSixthPower | 2021 | `public static ForgeTypeId MetersToTheSixthPower { get ; }` |
| Property | MicroinchesPerInchDegreeFahrenheit | 2021 | `public static ForgeTypeId MicroinchesPerInchDegreeFahrenheit { get ; }` |
| Property | MicrometersPerMeterDegreeCelsius | 2021 | `public static ForgeTypeId MicrometersPerMeterDegreeCelsius { get ; }` |
| Property | MilesPerHour | 2021 | `public static ForgeTypeId MilesPerHour { get ; }` |
| Property | MilesPerSecondSquared | 2021 | `public static ForgeTypeId MilesPerSecondSquared { get ; }` |
| Property | Milliamperes | 2021 | `public static ForgeTypeId Milliamperes { get ; }` |
| Property | Millimeters | 2021 | `public static ForgeTypeId Millimeters { get ; }` |
| Property | MillimetersOfMercury | 2021 | `public static ForgeTypeId MillimetersOfMercury { get ; }` |
| Property | MillimetersOfWaterColumn | 2021 | `public static ForgeTypeId MillimetersOfWaterColumn { get ; }` |
| Property | MillimetersOfWaterColumnPerMeter | 2021 | `public static ForgeTypeId MillimetersOfWaterColumnPerMeter { get ; }` |
| Property | MillimetersToTheFourthPower | 2021 | `public static ForgeTypeId MillimetersToTheFourthPower { get ; }` |
| Property | MillimetersToTheSixthPower | 2021 | `public static ForgeTypeId MillimetersToTheSixthPower { get ; }` |
| Property | Milliseconds | 2021 | `public static ForgeTypeId Milliseconds { get ; }` |
| Property | Millivolts | 2021 | `public static ForgeTypeId Millivolts { get ; }` |
| Property | Minutes | 2021 | `public static ForgeTypeId Minutes { get ; }` |
| Property | NanogramsPerPascalSecondSquareMeter | 2021 | `public static ForgeTypeId NanogramsPerPascalSecondSquareMeter { get ; }` |
| Property | NewtonMeters | 2021 | `public static ForgeTypeId NewtonMeters { get ; }` |
| Property | NewtonMetersPerMeter | 2021 | `public static ForgeTypeId NewtonMetersPerMeter { get ; }` |
| Property | NewtonSecondsPerSquareMeter | 2021 | `public static ForgeTypeId NewtonSecondsPerSquareMeter { get ; }` |
| Property | Newtons | 2021 | `public static ForgeTypeId Newtons { get ; }` |
| Property | NewtonsPerMeter | 2021 | `public static ForgeTypeId NewtonsPerMeter { get ; }` |
| Property | NewtonsPerSquareMeter | 2021 | `public static ForgeTypeId NewtonsPerSquareMeter { get ; }` |
| Property | NewtonsPerSquareMillimeter | 2021 | `public static ForgeTypeId NewtonsPerSquareMillimeter { get ; }` |
| Property | OhmMeters | 2021 | `public static ForgeTypeId OhmMeters { get ; }` |
| Property | OneToRatio | 2021 | `public static ForgeTypeId OneToRatio { get ; }` |
| Property | PascalSeconds | 2021 | `public static ForgeTypeId PascalSeconds { get ; }` |
| Property | Pascals | 2021 | `public static ForgeTypeId Pascals { get ; }` |
| Property | PascalsPerMeter | 2021 | `public static ForgeTypeId PascalsPerMeter { get ; }` |
| Property | PerMille | 2021 | `public static ForgeTypeId PerMille { get ; }` |
| Property | Percentage | 2021 | `public static ForgeTypeId Percentage { get ; }` |
| Property | Pi | 2021 | `public static ForgeTypeId Pi { get ; }` |
| Property | PoundForceFeet | 2021 | `public static ForgeTypeId PoundForceFeet { get ; }` |
| Property | PoundForceFeetPerFoot | 2021 | `public static ForgeTypeId PoundForceFeetPerFoot { get ; }` |
| Property | PoundForceSecondsPerSquareFoot | 2021 | `public static ForgeTypeId PoundForceSecondsPerSquareFoot { get ; }` |
| Property | PoundsForce | 2021 | `public static ForgeTypeId PoundsForce { get ; }` |
| Property | PoundsForcePerCubicFoot | 2021 | `public static ForgeTypeId PoundsForcePerCubicFoot { get ; }` |
| Property | PoundsForcePerFoot | 2021 | `public static ForgeTypeId PoundsForcePerFoot { get ; }` |
| Property | PoundsForcePerSquareFoot | 2021 | `public static ForgeTypeId PoundsForcePerSquareFoot { get ; }` |
| Property | PoundsForcePerSquareInch | 2021 | `public static ForgeTypeId PoundsForcePerSquareInch { get ; }` |
| Property | PoundsMass | 2021 | `public static ForgeTypeId PoundsMass { get ; }` |
| Property | PoundsMassPerCubicFoot | 2021 | `public static ForgeTypeId PoundsMassPerCubicFoot { get ; }` |
| Property | PoundsMassPerCubicInch | 2021 | `public static ForgeTypeId PoundsMassPerCubicInch { get ; }` |
| Property | PoundsMassPerFoot | 2021 | `public static ForgeTypeId PoundsMassPerFoot { get ; }` |
| Property | PoundsMassPerFootHour | 2021 | `public static ForgeTypeId PoundsMassPerFootHour { get ; }` |
| Property | PoundsMassPerFootSecond | 2021 | `public static ForgeTypeId PoundsMassPerFootSecond { get ; }` |
| Property | PoundsMassPerHour | 2021 | `public static ForgeTypeId PoundsMassPerHour { get ; }` |
| Property | PoundsMassPerMinute | 2021 | `public static ForgeTypeId PoundsMassPerMinute { get ; }` |
| Property | PoundsMassPerPoundDegreeFahrenheit | 2021 | `public static ForgeTypeId PoundsMassPerPoundDegreeFahrenheit { get ; }` |
| Property | PoundsMassPerSecond | 2021 | `public static ForgeTypeId PoundsMassPerSecond { get ; }` |
| Property | PoundsMassPerSquareFoot | 2021 | `public static ForgeTypeId PoundsMassPerSquareFoot { get ; }` |
| Property | Radians | 2021 | `public static ForgeTypeId Radians { get ; }` |
| Property | RadiansPerSecond | 2021 | `public static ForgeTypeId RadiansPerSecond { get ; }` |
| Property | Rankine | 2021 | `public static ForgeTypeId Rankine { get ; }` |
| Property | RankineInterval | 2021 | `public static ForgeTypeId RankineInterval { get ; }` |
| Property | RatioTo1 | 2021 | `public static ForgeTypeId RatioTo1 { get ; }` |
| Property | RatioTo10 | 2021 | `public static ForgeTypeId RatioTo10 { get ; }` |
| Property | RatioTo12 | 2021 | `public static ForgeTypeId RatioTo12 { get ; }` |
| Property | RevolutionsPerMinute | 2021 | `public static ForgeTypeId RevolutionsPerMinute { get ; }` |
| Property | RevolutionsPerSecond | 2021 | `public static ForgeTypeId RevolutionsPerSecond { get ; }` |
| Property | RiseDividedBy1000Millimeters | 2021 | `public static ForgeTypeId RiseDividedBy1000Millimeters { get ; }` |
| Property | RiseDividedBy10Feet | 2021 | `public static ForgeTypeId RiseDividedBy10Feet { get ; }` |
| Property | RiseDividedBy120Inches | 2021 | `public static ForgeTypeId RiseDividedBy120Inches { get ; }` |
| Property | RiseDividedBy12Inches | 2021 | `public static ForgeTypeId RiseDividedBy12Inches { get ; }` |
| Property | RiseDividedBy1Foot | 2021 | `public static ForgeTypeId RiseDividedBy1Foot { get ; }` |
| Property | Seconds | 2021 | `public static ForgeTypeId Seconds { get ; }` |
| Property | SlopeDegrees | 2021 | `public static ForgeTypeId SlopeDegrees { get ; }` |
| Property | SquareCentimeters | 2021 | `public static ForgeTypeId SquareCentimeters { get ; }` |
| Property | SquareCentimetersPerMeter | 2021 | `public static ForgeTypeId SquareCentimetersPerMeter { get ; }` |
| Property | SquareFeet | 2021 | `public static ForgeTypeId SquareFeet { get ; }` |
| Property | SquareFeetPer1000BritishThermalUnitsPerHour | 2021 | `public static ForgeTypeId SquareFeetPer1000BritishThermalUnitsPerHour { get ; }` |
| Property | SquareFeetPerFoot | 2021 | `public static ForgeTypeId SquareFeetPerFoot { get ; }` |
| Property | SquareFeetPerKip | 2021 | `public static ForgeTypeId SquareFeetPerKip { get ; }` |
| Property | SquareFeetPerSecond | 2021 | `public static ForgeTypeId SquareFeetPerSecond { get ; }` |
| Property | SquareFeetPerTonOfRefrigeration | 2021 | `public static ForgeTypeId SquareFeetPerTonOfRefrigeration { get ; }` |
| Property | SquareInches | 2021 | `public static ForgeTypeId SquareInches { get ; }` |
| Property | SquareInchesPerFoot | 2021 | `public static ForgeTypeId SquareInchesPerFoot { get ; }` |
| Property | SquareMeterKelvinsPerWatt | 2021 | `public static ForgeTypeId SquareMeterKelvinsPerWatt { get ; }` |
| Property | SquareMeters | 2021 | `public static ForgeTypeId SquareMeters { get ; }` |
| Property | SquareMetersPerKilonewton | 2021 | `public static ForgeTypeId SquareMetersPerKilonewton { get ; }` |
| Property | SquareMetersPerKilowatt | 2021 | `public static ForgeTypeId SquareMetersPerKilowatt { get ; }` |
| Property | SquareMetersPerMeter | 2021 | `public static ForgeTypeId SquareMetersPerMeter { get ; }` |
| Property | SquareMetersPerSecond | 2021 | `public static ForgeTypeId SquareMetersPerSecond { get ; }` |
| Property | SquareMillimeters | 2021 | `public static ForgeTypeId SquareMillimeters { get ; }` |
| Property | SquareMillimetersPerMeter | 2021 | `public static ForgeTypeId SquareMillimetersPerMeter { get ; }` |
| Property | StationingFeet | 2021 | `public static ForgeTypeId StationingFeet { get ; }` |
| Property | StationingMeters | 2021 | `public static ForgeTypeId StationingMeters { get ; }` |
| Property | StationingSurveyFeet | 2021 | `public static ForgeTypeId StationingSurveyFeet { get ; }` |
| Property | Therms | 2021 | `public static ForgeTypeId Therms { get ; }` |
| Property | ThousandBritishThermalUnitsPerHour | 2021 | `public static ForgeTypeId ThousandBritishThermalUnitsPerHour { get ; }` |
| Property | TonneForceMeters | 2021 | `public static ForgeTypeId TonneForceMeters { get ; }` |
| Property | TonneForceMetersPerMeter | 2021 | `public static ForgeTypeId TonneForceMetersPerMeter { get ; }` |
| Property | Tonnes | 2021 | `public static ForgeTypeId Tonnes { get ; }` |
| Property | TonnesForce | 2021 | `public static ForgeTypeId TonnesForce { get ; }` |
| Property | TonnesForcePerMeter | 2021 | `public static ForgeTypeId TonnesForcePerMeter { get ; }` |
| Property | TonnesForcePerSquareMeter | 2021 | `public static ForgeTypeId TonnesForcePerSquareMeter { get ; }` |
| Property | TonsOfRefrigeration | 2021 | `public static ForgeTypeId TonsOfRefrigeration { get ; }` |
| Property | UsGallons | 2021 | `public static ForgeTypeId UsGallons { get ; }` |
| Property | UsGallonsPerHour | 2021 | `public static ForgeTypeId UsGallonsPerHour { get ; }` |
| Property | UsGallonsPerMinute | 2021 | `public static ForgeTypeId UsGallonsPerMinute { get ; }` |
| Property | UsSurveyFeet | 2021 | `public static ForgeTypeId UsSurveyFeet { get ; }` |
| Property | UsTonnesForce | 2021 | `public static ForgeTypeId UsTonnesForce { get ; }` |
| Property | UsTonnesMass | 2021 | `public static ForgeTypeId UsTonnesMass { get ; }` |
| Property | VoltAmperes | 2021 | `public static ForgeTypeId VoltAmperes { get ; }` |
| Property | VoltAmperesPerSquareFoot | 2021 | `public static ForgeTypeId VoltAmperesPerSquareFoot { get ; }` |
| Property | VoltAmperesPerSquareMeter | 2021 | `public static ForgeTypeId VoltAmperesPerSquareMeter { get ; }` |
| Property | Volts | 2021 | `public static ForgeTypeId Volts { get ; }` |
| Property | Watts | 2021 | `public static ForgeTypeId Watts { get ; }` |
| Property | WattsPerCubicFoot | 2021 | `public static ForgeTypeId WattsPerCubicFoot { get ; }` |
| Property | WattsPerCubicFootPerMinute | 2021 | `public static ForgeTypeId WattsPerCubicFootPerMinute { get ; }` |
| Property | WattsPerCubicMeter | 2021 | `public static ForgeTypeId WattsPerCubicMeter { get ; }` |
| Property | WattsPerCubicMeterPerSecond | 2021 | `public static ForgeTypeId WattsPerCubicMeterPerSecond { get ; }` |
| Property | WattsPerFoot | 2021 | `public static ForgeTypeId WattsPerFoot { get ; }` |
| Property | WattsPerMeter | 2021 | `public static ForgeTypeId WattsPerMeter { get ; }` |
| Property | WattsPerMeterKelvin | 2021 | `public static ForgeTypeId WattsPerMeterKelvin { get ; }` |
| Property | WattsPerSquareFoot | 2021 | `public static ForgeTypeId WattsPerSquareFoot { get ; }` |
| Property | WattsPerSquareMeter | 2021 | `public static ForgeTypeId WattsPerSquareMeter { get ; }` |
| Property | WattsPerSquareMeterKelvin | 2021 | `public static ForgeTypeId WattsPerSquareMeterKelvin { get ; }` |